# St7SetNodeShowHideSelected

Sets whether the display of nodes considers the Show/Hide Selected setting.

long St7SetNodeShowHideSelected(long uID, bool UseSettings)
Input Parameters
uID
Strand7 model file ID.
UseSettings
If True, the visibility of selected/unselected nodes in the model window depends on the Show/Hide
Selected setting.
If False, the visibility of selected/unselected nodes in the model window is not affected by the
Show/Hide Selected setting.